Python 3.8.7 (tags/v3.8.7:6503f05, Dec 21 2020, 17:59:51) [MSC v.1928 64 bit (AMD64)] on win32
Type "help", "copyright", "credits" or "license()" for more information.
>>> 
=================== RESTART: C:\Users\ерепей\Desktop\Py_2.py ===================
Ноль в качестве знака операции
завершит работу программы
Введите необходимую функцию (+,-,*,/,возведение в степень - ^, логарифм - log)+
Введите аргумент x (число): x=1
Введите аргумент y (число): y=2
3.00
Введите необходимую функцию (+,-,*,/,возведение в степень - ^, логарифм - log)
=================== RESTART: C:\Users\ерепей\Desktop\Py_2.py ===================
Ноль в качестве знака операции
завершит работу программы
Введите необходимую функцию (+,-,*,/,возведение в степень - ^, логарифм - log)
=================== RESTART: C:\Users\ерепей\Desktop\Py_2.py ===================
Ноль в качестве знака операции
завершит работу программы
Введите необходимую функцию (+,-,*,/,^,log)log
Введите аргумент x (число): x=2
Введите аргумент y (число): y=2
1.0
Введите необходимую функцию (+,-,*,/,^,log)